In [1]:
import pandas as pd
from sqlite3 import connect

In [6]:
conn = connect("../db.sqlite")
df = pd.read_sql('SELECT * FROM persons', con=conn)
df

                         name  id
0  Chigozie Emmanuel Alexande   0
1                Fresh Banana   2
2                   Chigozies   3
3                  Fresh Goat   5
4             Banana "; Brain   6
5                 Banana Fish   7
6                Banana Barin   8
7                 Banana Bari   9